fix: transaction rejected
